#ifndef RR_HPP
#define RR_HPP


void function_RR(int **ALL, int SIZE)
{
	/*
	Результатом этой функции является файлы RR.txt и log_RR.txt.
		
		Формат файла RR.txt:
	Первая строка – это общее время для всех задач  с момента поступления  до момента их завершения
		Следующие SIZE строк имеют вид таблицы :
	1-й столбец - это №такта начала задачи
	2-й столбец - это время с момента поступления задачи до момента её завершения

	В файле log_RR.txt выводятся поэтапные вычисления времени, затраченного каждой хадачей
	*/
}
#endif 