#ifndef SJN_HPP
#define SJN_HPP


void function_SJN(long unsigned int **ALL, int SIZE)
{
	/*
	Результатом этой функции является файлы SJN.txt и log_SJN.txt.

	Формат файла SJN.txt:
	Первая строка – это общее время для всех задач с момента поступления до момента их завершения
	Следующие SIZE строк имеют вид таблицы :
	1-й столбец - это №такта начала задачи
	2-й столбец - это время с момента поступления задачи до момента её завершения

	В файле log_SJN.txt выводятся поэтапные вычисления времени, затраченного каждой задачей
	*/
}
#endif 