#ifndef SRT_HPP
#define SRT_HPP


void function_SRT(long unsigned int **ALL, int SIZE)
{
	/*
	Результатом этой функции является файлы SRT.txt и log_SRT.txt.

	Формат файла SRT.txt:
	Первая строка – это общее время для всех задач  с момента поступления до момента их завершения
	Следующие SIZE строк имеют вид таблицы :
	1-й столбец - это №такта начала задачи
	2-й столбец - это время с момента поступления задачи до момента её завершения

	В файле log_SRT.txt выводятся поэтапные вычисления времени, затраченного каждой задачей
	*/
}
#endif 